practice_016_leetcode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Practice #016: Leetcode</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Practice #016: Leetcode</h1>

<div id="outline-container-org902a626" class="outline-2">
<h2 id="org902a626">Leetcode: 279. Perfect Squares</h2>
<div class="outline-text-2" id="text-org902a626">
<p>
<a href="https://leetcode.com/problems/perfect-squares/">Problem Statement</a>
</p>

<p>
Retrospective: The <a href="top_down.html#ID-3463A33B-D953-4E75-895D-0BE4AAB16813">Top-down</a> solution received time-limit and I had to code the <a href="dynamic_programming.html#ID-241ABA4C-A86F-405F-B6FC-85BF441EB24B">Dynamic Programming</a>.
</p>

<p>
This problem is a variation of <a href="knapsack_problem.html#ID-0F085C54-E45A-41E6-951B-79CFD7ECBED5">Knapsack problem</a>, but on this one the value is always 1 for each used item.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">numSquares</span>(<span style="font-weight: bold;">self</span>, n: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        inf = 10**5
        <span style="font-weight: bold; font-style: italic;">ps</span> = []
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, n + 1):
            <span style="font-weight: bold;">if</span> i * i &gt; n:
                <span style="font-weight: bold;">break</span>
            ps.append(i * i)

        <span style="font-weight: bold; font-style: italic;">dp</span> = [inf] * (n + 1)
        <span style="font-weight: bold; font-style: italic;">dp</span>[0] = 0
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, n + 1):
            <span style="font-weight: bold;">for</span> s <span style="font-weight: bold;">in</span> ps:
                <span style="font-weight: bold;">if</span> s &gt; <span style="font-weight: bold; font-style: italic;">i</span>:
                    <span style="font-weight: bold;">continue</span>
                dp[<span style="font-weight: bold; font-style: italic;">i</span>] = <span style="font-weight: bold;">min</span>(dp[i], 1 + dp[i - s])
        <span style="font-weight: bold;">return</span> dp[n]


<span style="font-weight: bold;">assert</span> Solution().numSquares(12) == 3
<span style="font-weight: bold;">assert</span> Solution().numSquares(13) == 2
</pre>
</div>
</div>
</div>

<div id="outline-container-org84ec600" class="outline-2">
<h2 id="org84ec600">Leetcode: 1145. Binary Tree Coloring Game</h2>
<div class="outline-text-2" id="text-org84ec600">
<p>
<a href="https://leetcode.com/problems/binary-tree-coloring-game/">Problem Statement</a>
</p>

<p>
For nodes in the tree, color it as blue if possible, find the path between it and each node in the path following the problem's rule.  After it is done, count the number of blue nodes (colored and not accessible by any red node) and the number of red nodes.  If there is no initial node which blue wins, return false otherwise true.  Time complexity is \(O(n^2)\) and space \(O(n)\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> functools <span style="font-weight: bold;">import</span> cache

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Definition for a binary tree node.</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">class TreeNode:</span>
<span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">def __init__(self, val=0, left=None, right=None):</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.val = val</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.left = left</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.right = right</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">btreeGameWinningMove</span>(<span style="font-weight: bold;">self</span>, root: Optional[TreeNode], n: <span style="font-weight: bold;">int</span>, x: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">bool</span>:

        <span style="font-weight: bold; text-decoration: underline;">@cache</span>
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">count</span>(node):
            <span style="font-weight: bold;">if</span> node <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
                <span style="font-weight: bold;">return</span> 0
            <span style="font-weight: bold;">return</span> 1 + count(node.left) + count(node.right)

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">path</span>(node, val):
            <span style="font-weight: bold;">if</span> node <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
                <span style="font-weight: bold;">return</span> (<span style="font-weight: bold; text-decoration: underline;">False</span>, [])
            <span style="font-weight: bold;">if</span> node.val == val:
                <span style="font-weight: bold;">return</span> (<span style="font-weight: bold; text-decoration: underline;">True</span>, [node])
            l = path(node.left, val)
            <span style="font-weight: bold;">if</span> l[0]:
                l[1].append(node)
                <span style="font-weight: bold;">return</span> l
            r = path(node.right, val)
            <span style="font-weight: bold;">if</span> r[0]:
                r[1].append(node)
                <span style="font-weight: bold;">return</span> r
            <span style="font-weight: bold;">return</span> (<span style="font-weight: bold; text-decoration: underline;">False</span>, [])

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">print_nodes</span>(r):
            <span style="font-weight: bold;">print</span>(<span style="font-weight: bold;">list</span>(<span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">lambda</span> n: n.val, r)))

        ans = <span style="font-weight: bold; text-decoration: underline;">False</span>
        <span style="font-weight: bold; font-style: italic;">_</span>, <span style="font-weight: bold; font-style: italic;">r1</span> = path(root, x)
        <span style="font-weight: bold;">for</span> y <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, n + 1):
            <span style="font-weight: bold;">if</span> y == x:
                <span style="font-weight: bold;">continue</span>
            <span style="font-weight: bold; font-style: italic;">_</span>, <span style="font-weight: bold; font-style: italic;">r2</span> = path(root, y)
            i = <span style="font-weight: bold;">len</span>(r1) - 1
            j = <span style="font-weight: bold;">len</span>(r2) - 1
            <span style="font-weight: bold;">while</span> i &gt;= 0 <span style="font-weight: bold;">and</span> j &gt;= 0 <span style="font-weight: bold;">and</span> r1[i] == r2[j]:
                i -= 1
                j -= 1
            p = r1[:i+2] + <span style="font-weight: bold;">list</span>(<span style="font-weight: bold;">reversed</span>(r2[:j+1]))
            <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">len</span>(p) % 2 == 0:
                i = <span style="font-weight: bold;">len</span>(p) // 2 - 1
                j = i + 1
            <span style="font-weight: bold;">else</span>:
                i = (<span style="font-weight: bold;">len</span>(p) + 1) // 2 - 1
                j = i + 1
            <span style="font-weight: bold;">if</span> (p[j] <span style="font-weight: bold;">in</span> (p[i].left, p[i].right)) <span style="font-weight: bold;">and</span> n - count(p[j]) &lt; count(p[j]):
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>
            <span style="font-weight: bold;">if</span> (p[i] <span style="font-weight: bold;">in</span> (p[j].left, p[j].right)) <span style="font-weight: bold;">and</span> count(p[i]) &lt; n - count(p[i]):
                <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">True</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold; text-decoration: underline;">False</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org32faba4" class="outline-2">
<h2 id="org32faba4">Leetcode: 1066. Campus Bikes II</h2>
<div class="outline-text-2" id="text-org32faba4">
<p>
<a href="https://leetcode.com/problems/campus-bikes-ii/">Problem Statement</a>
</p>

<p>
This is a classic <a href="dynamic_programming.html#ID-241ABA4C-A86F-405F-B6FC-85BF441EB24B">Dynamic Programming</a>.  We try to pair, one by one, all workers with all bikes while keeping track of the used bikes.  Search-space is \(O(n \times 2^m)\) and time complexity is \(O(m)\) with a total time complexity of \(O(n \times m \times 2^m)\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> functools <span style="font-weight: bold;">import</span> cache
<span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">assignBikes</span>(<span style="font-weight: bold;">self</span>, workers: List[List[<span style="font-weight: bold;">int</span>]], bikes: List[List[<span style="font-weight: bold;">int</span>]]) -&gt; <span style="font-weight: bold;">int</span>:
        n = <span style="font-weight: bold;">len</span>(workers)
        <span style="font-weight: bold; font-style: italic;">m</span> = <span style="font-weight: bold;">len</span>(bikes)

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dist</span>(a, b):
            <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">abs</span>(a[0] - b[0]) + <span style="font-weight: bold;">abs</span>(a[1] - b[1])

        <span style="font-weight: bold; text-decoration: underline;">@cache</span>
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(i, vis):
            <span style="font-weight: bold;">if</span> i == n:
                <span style="font-weight: bold;">return</span> 0
            ans = <span style="font-weight: bold; text-decoration: underline;">None</span>
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(m):
                <span style="font-weight: bold;">if</span> (vis &amp; (1 &lt;&lt; j)) != 0:
                    <span style="font-weight: bold;">continue</span>
                cur = dist(workers[i], bikes[j]) + dfs(i + 1, vis | (1 &lt;&lt; j))
                <span style="font-weight: bold;">if</span> ans <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">or</span> ans &gt; cur:
                    ans = cur
            <span style="font-weight: bold;">return</span> ans

        <span style="font-weight: bold;">return</span> dfs(0, 0)


<span style="font-weight: bold;">assert</span> Solution().assignBikes([[0, 0], [2, 1]], [[1, 2], [3, 3]]) == 6
<span style="font-weight: bold;">assert</span> Solution().assignBikes([[0, 0], [1, 1], [2, 0]], [[1, 0], [2, 2], [2, 1]]) == 4
<span style="font-weight: bold;">assert</span> (
    Solution().assignBikes(
        [[0, 0], [1, 0], [2, 0], [3, 0], [4, 0]],
        [[0, 999], [1, 999], [2, 999], [3, 999], [4, 999]],
    )
    == 4995
)
</pre>
</div>
</div>
</div>
</div>
</body>
</html>